In [1]:
import pandas as pd

In [2]:
players={
    "Age":[37,21,33,28,31],
    "Matches":[57,23,65,41,77],
    "Half Centuries":[3,2,3,1,2],
    "Centuries":[1,3,1,1,0,]
}

In [3]:
plyr_df = pd.DataFrame(players, index=["Shoaib Malik","Babar Azam","M.Hafeez","Haris Sohail","Asad Shafiq"])

In [4]:
plyr_df

              Age  Matches  Half Centuries  Centuries
Shoaib Malik   37       57               3          1
Babar Azam     21       23               2          3
M.Hafeez       33       65               3          1
Haris Sohail   28       41               1          1
Asad Shafiq    31       77               2          0

# Deleting Columns from Dataframe

1. Delete column by drop function
        a. by specifying column name
        b. by specifying column index
2. By del keyword

# Delete Column with drop Function

**a. By specifying column name**

Syntax: dataframe.drop(["Column Name"],axis = 1 (for column))

In [5]:
del_column= plyr_df.drop(["Half Centuries"],axis = 1)

In [6]:
del_column

              Age  Matches  Centuries
Shoaib Malik   37       57          1
Babar Azam     21       23          3
M.Hafeez       33       65          1
Haris Sohail   28       41          1
Asad Shafiq    31       77          0

In [7]:
plyr_df

              Age  Matches  Half Centuries  Centuries
Shoaib Malik   37       57               3          1
Babar Azam     21       23               2          3
M.Hafeez       33       65               3          1
Haris Sohail   28       41               1          1
Asad Shafiq    31       77               2          0

**Note:** drop function drops the column from the dataset temorary that means it doesnot change the orignal dataset but it simply drop the column temporary.If you want to drop the column from orignal dataset permenently than you can use del keyword (which we will use later)

**b. By specifying columns Index**

Syntax: dataframe.drop(dataframe.columns[column index] , axis = 1)

In [8]:
del_column2=plyr_df.drop(plyr_df.columns[2],axis = 1)

In [9]:
del_column2

              Age  Matches  Centuries
Shoaib Malik   37       57          1
Babar Azam     21       23          3
M.Hafeez       33       65          1
Haris Sohail   28       41          1
Asad Shafiq    31       77          0

It drops the "Half Centuries" Column (2nd index column) from the Dataset temporary

In [10]:
plyr_df

              Age  Matches  Half Centuries  Centuries
Shoaib Malik   37       57               3          1
Babar Azam     21       23               2          3
M.Hafeez       33       65               3          1
Haris Sohail   28       41               1          1
Asad Shafiq    31       77               2          0

# 2. By "del" Keyword

Syntax: del dataframe["column name"]

In [11]:
del plyr_df["Matches"]

In [12]:
plyr_df

              Age  Half Centuries  Centuries
Shoaib Malik   37               3          1
Babar Azam     21               2          3
M.Hafeez       33               3          1
Haris Sohail   28               1          1
Asad Shafiq    31               2          0

It deletes the "Matches" Column From the Orignal Dataset